package com.example.nutritional.bean.food;

import java.util.List;

/**
 * @author 69182
 */
public
class GetAllNutritionInfo {

    /**
     * nutrientInformation : [{"id":1,"name":"能量","otherName":"热量","unit":"千卡","introduction":null,"deSymptom":null,"muchHarm":null,"source":null,"focusGroups":null,"highContentOfSource":null},{"id":2,"name":"蛋白质","otherName":null,"unit":"克","introduction":"蛋白质（protein）是生命的物质基础，是有机大分子，是构成细胞的基本有机物，是生命活动的主要承担者。没有蛋白质就没有生命。氨基酸是蛋白质的基本组成单位。它是与生命及与各种形式的生命活动紧密联系在一起的物质。机体中的每一个细胞和所有重要组成部分都有蛋白质参与。蛋白质占人体重量的16%~20%，即一个60kg重的成年人其体内约有蛋白质9.6~12kg。人体内蛋白质的种类很多，性质、功能各异，但都是由20多种氨基酸（Amino acid）按不同比例组合而成的，并在体内不断进行代谢与更新。","deSymptom":"蛋白质缺乏在成人和儿童中都有发生，但处于生长阶段的儿童更为敏感。蛋白质的缺乏常见症状是代谢率下降，对疾病抵抗力减退，易患病，远期效果是器官的损害，常见的是儿童的生长发育迟缓、营养不良、体质量下降、淡漠、易激怒、贫血以及干瘦病或水肿，并因为易感染而继发疾病。蛋白质的缺乏，往往又与能量的缺乏共同存在即蛋白质\u2014热能营养不良，分为两种，一种指热能摄入基本满足而蛋白质严重不足的营养性疾病，称加西卡病。另一种即为\u201c消瘦\u201d，指蛋白质和热能摄入均严重不足的营养性疾病。","muchHarm":"蛋白质如果摄取过量的话也会在体内转化成脂肪，造成脂肪堆积。肾脏要排泄进食的蛋白质，当分解蛋白质时会产生大量的氮素这样会增加肾脏的负担。蛋白质，尤其是动物性蛋白摄入过多，对人体同样有害。首先过多的动物蛋白质的摄入，就必然摄入较多的动物脂肪和胆固醇。其次蛋白质过多本身也会产生有害影响。正常情况下，所以必须将过多的蛋白质脱氨分解，氮则由尿排出体外，这加重了代谢负担，而且，这一过程需要大量水分，从而加重了肾脏的负荷，若肾功能本来不好，则危害就更大。过多的动物蛋白摄入，也造成含硫氨基酸摄入过多，这样可加速骨骼中钙质的丢失，易产生骨质疏松。","source":"要保证有足够数量和质量的蛋白质食物．根据营养学家研究，一个成年人每天通过新陈代谢大约要更新300g以上蛋白质，其中3/4来源于机体代谢中产生的氨基酸，这些氨基酸的再利用大大减少了需补给蛋白质的数量．一般地讲，一个成年人每天摄入60g～80g蛋白质，基本上已能满足需要。","focusGroups":"老年人、幼儿、运动员、孕产妇","highContentOfSource":"蛋白质的主要来源，分为动物性蛋白质、植物性蛋白质。一般来说，动物蛋白质的营养价值比植物蛋白质高。 奶类：如牛奶、羊奶、马奶等； 畜肉：如牛、羊、猪肉等； 禽肉：如鸡、鸭、鹅、鹌鹑、鸵鸟等； 蛋类：如鸡蛋、鸭蛋、鹌鹑蛋等 鱼、虾、蟹等；还有大豆类，包括黄豆、大青豆和黑豆等，其中以黄豆的营养价值最高，它是婴幼儿食品中优质的蛋白质来源；此外像芝麻、瓜子、核桃、杏仁、松子等干果类的蛋白质的含量均较高。"},{"id":3,"name":"脂肪","otherName":null,"unit":"克","introduction":"脂肪是身体组织的重要成分，也是供给热量的主要原料。细胞中的原生质和细胞膜均含有脂肪化合物，食物中的脂类95％以上是甘油三酯，此外还有胆固醇脂和磷脂。","deSymptom":"必需脂肪酸缺乏，可引起生长迟缓、生殖障碍、皮肤受损等；另外，还可引起肝脏、肾脏、神经和视觉等多种疾病。","muchHarm":"脂肪摄入过量将产生肥胖，并导致一些慢性病的发生；膳食脂肪总量增加，还会增大某些癌症的发生几率。","source":"高脂肪的食物有坚果类（花生，芝麻，开心果，核桃，松仁等）还有动物类皮肉（肥猪肉，猪油，黄油，酥油，植物油等）还有些油炸食品，面食，点心，蛋糕等等。低脂肪的食物有水果类（苹果，柠檬，等），蔬菜类（冬瓜，黄瓜，丝瓜，白萝卜，苦瓜，韭菜，绿豆芽，辣椒等），鸡肉，鱼肉，紫菜，木耳，荷叶茶，醋等等。","focusGroups":"少年、儿童、孕妇","highContentOfSource":"食用油、松子、腊肉、芝麻酱、杏仁、猪肉"},{"id":4,"name":"碳水化合物","otherName":"糖","unit":"克","introduction":"碳水化合物亦称糖类化合物，是自然界存在最多、分布最广的一类重要的有机化合物。主要由碳、氢、氧所组成。葡萄糖、蔗糖、淀粉和纤维素等都属于糖类化合物。","deSymptom":"膳食中缺乏碳水化合物将导致全身无力，疲乏、血糖含量降低，产生头晕、心悸、脑功能障碍等。严重者会导致低血糖昏迷。","muchHarm":"当膳食中碳水化合物过多时，就会转化成脂肪贮存于身体内，使人过于肥胖而导致各类疾病如高血脂、糖尿病等。","source":"糖类、谷物（如水稻、小麦、玉米、大麦、燕麦、高粱等）、水果（如甘蔗、甜瓜、西瓜、香蕉、葡萄等）、干果类、干豆类、根茎蔬菜类（如胡萝卜、番薯等）等。","focusGroups":"儿童、青少年、中年、老年人","highContentOfSource":"面条、馒头、面包、甘薯、米饭、玉米片、南瓜、西瓜、土豆"},{"id":5,"name":"钙","otherName":null,"unit":"毫克","introduction":"钙是人体内含量最多的一种无机盐。正常人体内钙的含量为1200～1400克，约占人体重量的1.5%～2.0%，其中99%存在于骨骼和牙齿之中。另外，1%的钙大多数呈离子状态存在于软组织、细胞外液和血液中，与骨钙保持着动态平衡。机体内的钙，一方面构成骨骼和牙齿，另一方面则可参与各种生理功能和代谢过程，影响各个器官组织的活动。","deSymptom":"少年儿童：厌食、偏食；不易入睡、易惊醒；易感冒；头发稀疏；智力发育迟缓；学步、出牙晚或出牙不整齐；阵发性腹痛腹泻；X或O型腿；鸡胸。 青年：精力不集中；容易疲劳；腰酸背痛；免疫力低；蛀牙或牙齿发育不良。 孕妇及哺乳期妇女：抽筋乏力；关节疼；头晕；贫血及产前高血压综合征；水肿及乳汁分泌不足。 老年人：老年性皮肤病痒；脚后跟疼，腰椎、颈椎疼痛；牙齿松动、脱落；明显的驼背、身高降低；食欲减退、消化道溃疡；多梦、失眠、烦躁、易怒等。","muchHarm":"1、补钙过量增加骨质疏松风险 2、补钙过量增加结石病风险 3、补钙过量增加心脏损伤风险 4、补钙过量影响矿物质吸收 5、出现高钙血症 6、胃肠道不良反应","source":"牛奶、酸奶、奶酪、虾 皮、海产品、芝麻、芝麻酱、大豆、豆制品。 良好来源：鸡蛋、绿叶蔬菜、硬果、食用菌藻类、鱼粉、鱼松等。","focusGroups":"幼儿、青少年、孕妇、更年期妇女、老年人","highContentOfSource":"奶及奶制品、豆类、坚果、木耳、虾皮、海带、发菜、芝麻酱"},{"id":6,"name":"钠","otherName":null,"unit":"毫克","introduction":"钠和钾是同时被发现的元素，两者是正常生长发育中不可或缺的物质。钠可使钙(钙食品)和其他矿物质溶于血液之中，于新陈代谢息息相关。","deSymptom":"钠缺乏症可造成生长缓慢、食欲减退、由于失水体重减轻、哺乳期的母亲奶水减少、肌肉痉挛、恶心、腹泻和头痛。此外，过多出汗和盐量不足可同时使热能耗尽，在这种情况下，应服用盐片和补充大量水分。","muchHarm":"膳食中长期摄入过多的钠将导致高血压，如果误将食盐当作食糖给婴幼儿食用，有可能导致死亡。","source":"膳食中的钠主要存在于食盐中，它是烹饪中重要的调味品，也是保证肌体水份平衡的最重要物质，没有食盐，人的生存将受到障碍。食盐在防止食品腐败上有重要作用，钠是构成食盐的不可缺少的成份。","focusGroups":"乳母、老年人","highContentOfSource":"食盐、酱油、盐渍品、腌制肉类、酱咸菜类、发酵豆制品、咸味休闲食品"},{"id":7,"name":"镁","otherName":null,"unit":"毫克","introduction":"镁是维持人体生命活动的必需元素，具有调节神经和肌肉活动、增强耐久力的神奇功能。","deSymptom":"镁缺乏可致血清钙下降，神经肌肉兴奋性亢进;对血管功能可能有潜在的影响，有人报告低镁血症患者可有房室性早搏、房颤以及室速与室颤，半数有血压升高;同时，镁缺乏可能是绝经后骨质疏松症的一种危险因素;","muchHarm":"过量镁摄入，血清镁在1.5-2.5mmol/L时，常伴有恶心、胃肠痉挛等胃肠道反应;当血清镁增高到2.5-3.5mmol/L时则出现嗜睡、肌无力、膝腱反射弱、肌麻痹;但血清镁增至5mmol/L时，深腱反射消失;血清镁超过5mmol/L时可发生随意肌或呼吸肌麻痹;血清镁7.5mmol/L或更高时可以发生心脏完全传导阻滞或心搏停止。 高镁血症可引起低血钙，其部分机制可能是由于甲状旁腺素分泌降低或靶器官对激素的反应性降低。高镁血症可影响骨和血液凝固。在尿毒症时，骨中镁含量显著增高。更重要的是镁过多可致骨异常。镁过多可干扰血小板粘附和凝血酶原生成时间。尿毒症时凝血障碍部分原因可能是由于慢性高镁血症所致。","source":"海参、榛子、西瓜子、鲍鱼、燕麦片、小茴香、小米、苋菜、葵花子、虾皮、砖茶、绿茶、花茶、海蜇皮、黄豆、木耳、海米、咖啡、可可粉、棉籽粉、花生粉、黑芝麻、大豆粉。 良好来源有松子、绿豆、青豆、芸豆、口蘑、海带、豆腐粉、小豆、黑米、香菇(香菇食品)、蚕豆、莲子、干贝、姜、金针菜、豌豆、坚果、花生酱、全谷物(如小麦、大麦和燕麦等)。 一般来源有香蕉、牛肉、面包、玉米、鱼及海产品、猪肉及大多数绿叶蔬菜(蔬菜食品)。 微量来源有卷心菜、茄子、蛋类、动植物油(油食品)脂、冰淇淋、大多数水果(水果食品)、糖和香肠等。","focusGroups":"中年、更年期妇女、老年人","highContentOfSource":"大麦、黑米、荞麦、麸皮、黄豆、苋菜、口蘑、干木耳、干香菇、干苔菜"},{"id":8,"name":"铁","otherName":null,"unit":"毫克","introduction":"铁是血红蛋白的组成成分，与氧结合，运输到身体的每一个部分，供人们呼吸氧化，以提供能量(能量食品)，消化(消化食品)食物，获得营养;人体内的肌红蛋白存在于肌肉之中，含有亚铁血红素，也结合着氧，是肌肉中的\u201c氧库\u201d。当运动(运动食品)时肌红蛋白中的氧释放出来，随时供应肌肉活动所需的氧。心、肝、肾这些具有高度生理活动能力和生化功能的细胞线粒体内，储存的铁特别多，线粒体是细胞的\u201c能量工厂\u201d，铁直接参与能量的释放。 [2] 铁还可以促进发育，增加对疾病的抵抗力，调节组织呼吸，防止疲劳，构成血红素，预防和治疗因缺铁而引起的贫血，使皮肤恢复良好的血色。 成人体内约有4～5克铁，其中72%以血红蛋白、35%以肌红蛋白、0.2以其它化合物形式存在，其余为储备铁。储备铁约占25%，主要以铁蛋白的形式储存在肝、脾和骨髓中。成人摄取量是10～15mg。妊娠期妇女需要30mg。","deSymptom":"1、贫血：严重时可增加儿童和母亲死亡率，使机体工作能力明显下降。 2、行为和智力方面：铁缺乏可引起心理活动和智力发育的损害及行为改变。铁缺乏（尚未出现贫血时的缺乏）还可损害儿童的认知能力，而且在以后补充铁后也难以恢复。","muchHarm":"1 铁在人体内贮存过多，因而可引致铁在体内潜在的有害作用，体内铁的贮存过多与多种疾病如心脏和肝脏疾病、糖尿病、某些肿瘤有关。 2 食物中摄铁过多，使体内铁量超过正常的10～20倍，就可能出现慢性中毒症状：肝、脾有大量铁沉着，可表现为肝硬化、骨质疏松、软骨钙(钙食品)化、皮肤呈棕黑色或灰暗、胰岛素分泌减少而导致糖尿病(糖尿病食品)。","source":"铁(铁食品)的丰富来源有牛肾、鱼子酱、鸡内脏、可可粉、鱼粉、肝脏、土豆、精白米、黄豆粉、麦糠、麦胚和小麦黄豆混合粉。 良好来源有牛肉、红糖、蛤肉、干果、蛋黄、猪和羊肾脏。 良好来源：瘦肉、红糖、蛋黄、猪肾、羊肾、干果（杏干、葡萄干），啤酒酵母菌、海草、赤糖糊及麦。 一般来源：鱼、谷物、菠菜、扁豆、豌豆、芥菜叶、蚕豆、瓜子（南瓜、西葫芦等种子） 微量来源：奶制品、蔬菜各水果 此外用铸铁锅煮番茄或其它酸性食物，也可增添铁质，锅会把有益于健康的铁深入食物内。","focusGroups":"妇女、孕妇、儿童、老人","highContentOfSource":"苔菜(干) 283.7 毫克 普中红蘑(干) 235.1 毫克 猪胆肝 181.3 毫克 口蘑(干) 137.5 毫克 木耳(干) 97.4 毫克 发菜(干) 85.2 毫克 菊花[怀菊花] 78 毫克 紫菜(干) 54.9 毫克 芝麻酱 50.3 毫克 鸭肝(母麻鸭) 50.1 毫克 桑葚(干) 42.5 毫克 青稞 40.7 毫克 鸭血 39.6 毫克 芥菜干 39.3 毫克 猪肝 22.9 毫克 芝麻籽(黑) 22.7 毫克 菠菜(脱水) 25.9 毫克 豆腐干(小香干) 23.3 毫克"},{"id":9,"name":"碘","otherName":null,"unit":"微克","introduction":"碘在体内主要参与甲状腺素的合成，其生理作用也是通过甲状腺素的作用表现出来。至今尚未发现碘的独立功能。甲状腺素调节和存进代谢，与生长发育关系密切。","deSymptom":"机体因缺碘导致的一系列疾病以前命名为地方性甲状腺肿和地方性克汀病,现在统称为碘缺乏病。","muchHarm":"碘过量可导致甲状腺功能减退症、自身免疫甲状腺病和乳头状甲状腺癌的发病率显著增加。","source":"碘主要来自海产品,如海带、紫菜、海蜇、带鱼等。","focusGroups":"青少年、孕妇、老年人","highContentOfSource":"裙带菜（干）、紫菜（干）、海带（鲜）、鸡精、虾皮、虾酱、虾米、豆腐干。"},{"id":10,"name":"锌","otherName":null,"unit":"毫克","introduction":"锌是人体不可缺少的微量元素，补锌可以促进儿童身体及智力发育。专家进一步指出，年龄为12岁至13岁儿童补锌最有利于提高其智力，此时补锌等于补智。 锌元素主要存在于海产品、动物内脏中,其它食物里含锌量很少水、主食类食物以及孩子们爱吃的蛋类里几乎都没有锌,含有锌的蔬菜和水果也不是很多。","deSymptom":"儿童 味觉障碍：厌食、偏食或异食； 皮肤疾患：易患口腔溃疡，受损伤口不易愈合，青春期痤疮等； 生长发育不良：身材矮小、瘦弱； 免疫力下降，经常感冒、发烧； 智力发育落后； 肝脾肿大 孕妇 妊娠反应加重：嗜酸，呕吐加重 宫内胎儿发育迟缓：导致早产儿、低体重儿 分娩合并症增多：产程延长、流产、早产、胎儿畸形率增高：脑部中枢神经系统畸形 肝脾肿大 成年男性 男性不育：少精、弱精或精液不液化、男性前列腺炎、 肝脾肿大","muchHarm":"吸入会引起口渴、胸部紧束感、干咳、头痛、头晕、高热、寒战等。粉尘对眼有刺激性。口服刺激胃肠道。长期反复接触对皮肤有刺激性。","source":"瘦肉、猪肝、鱼类、蛋黄等。其中以牡蛎含锌最为高。据化验，动物性食品含锌量普遍较多，每一百克动物性食品中大约含锌3\u20145毫克，并且动物性蛋白质分解后所产生的氨基酸还能促进锌的吸收。植物性食品中锌较少。每一百克植物性食品中大约含锌1毫克。各种植物性食物中含锌量比较高的有豆类、花生、小米、萝卜、大白菜等。","focusGroups":"儿童、孕妇、成年男性、皮肤病患者","highContentOfSource":"生蚝 71.2 小麦胚粉 23.4 山核桃 12.6 扇贝(鲜) 11.7 口蘑 9.04 香菇(干) 8.47 羊肉(瘦) 6.06 葵花子(炒) 5.91 猪肚 5.78 牛肝 5.01"},{"id":11,"name":"硒","otherName":null,"unit":"微克","introduction":"硒是人体必需的微量元素。中国营养学会也将硒列为人体必需的15种营养素之一，国内外大量临床实验明，人体缺硒可引起某些重要器官的功能失调，导致许多严重疾病发生。","deSymptom":"1、缺乏硒会导致未老先衰。 2、严重缺乏硒会引发心肌病及心肌衰竭。 3、发生克山病，大骨节病。 4、精神萎靡不振，精子活力下降，易患感冒。","muchHarm":"慢性硒中毒往往是由于每天从食物中摄取硒2400～3000微克，长达数月之久才出现症状。表现为脱发、脱指甲、皮肤黄染、口臭、疲劳、龋齿易感性增加、抑郁等。一般慢性硒中毒都有头晕、头痛、倦怠无力、口内金属味、恶心、呕吐、食欲不振、腹泻、呼吸和汗液有蒜臭味，还可有肝肿大、肝功能异常，自主神经功能紊乱，尿硒增高。长期高硒使小儿身长、体重发育迟缓，毛发粗糙脆弱，甚至有神经症状及智能改变。慢性硒中毒的主要特征是脱发及指甲形状的改变。","source":"有芝麻、动物内脏、大蒜(大蒜食品)、蘑菇、海米、鲜贝、淡菜、金针菇、海参、鱿鱼、苋菜、鱼粉、黄油(油食品)、啤酒酵母、小麦胚和龙虾。良好来源有海蟹、干贝、带鱼、松花鱼、黄鱼、龙虾、羊油、豆油、猪肾脏、全小麦粒(粉)、螃蟹、猪肉和羊肉。一般来源有小茴香、冬菇、桃酥、红萝卜、全燕麦粉、啤酒、大米、橘汁和全脂牛奶。微量来源有玉米、小米、核桃、奶油蛋糕、油饼、水果(水果食品)和糖。","focusGroups":"儿童、癌症患者、糖尿病患者、孕妇、乳母","highContentOfSource":"魔芋精粉 350.15 (微克) 鲑鱼籽酱 203.09 (微克) 猪肾(腰子) 156.77 (微克) 鱿鱼(干) 156.12 (微克) 海参(干) 150 (微克) 贻贝(干) 120.47 (微克) 猪肾[猪腰子 111.77 (微克) 墨鱼(干 ) 104.4 (微克) 松蘑(干) 98.44 (微克) 15牡蛎[海蛎子] 86.64 (微克) 海蟹 82.65 (微克) 堤鱼 80.36 (微克) 香海螺 79.2 (微克) 赤眼鳟[金目鱼] 78.76 (微克) 花蛤蜊 77.1 (微克) 扇贝(干) 76.35 (微克) 虾米 75.4 (微克) 红螺 74.78 (微克) 虾皮 74.43 (微克) 花豆(紫) 74.06 (微克)"},{"id":12,"name":"胡萝卜素","otherName":"Carotene","unit":"微克","introduction":"胡萝卜中含有大量的β-胡萝卜素，摄入人体消化器官后，可以转化成维生素A，是目前最安全补充维生素A的产品 （单纯补充化学合成维生素A，过量时会使人中毒）。它可以维持眼睛和皮肤的健康，改善夜盲症、皮肤粗糙的状况，有助于身体免受自由基的伤害。不宜与醋等酸性物质同时服用. 1、维持皮肤粘膜层的完整性，防止皮肤干燥，粗糙； 2、构成视觉细胞内的感光物质； 3、促进生长发育，有效促进健康及细胞发育，预防先天不足。促进骨骼及牙齿健康成长； 4、维护生殖功能； 5、维持和促进免疫功能。数据介绍，胡萝卜具有预防和抑制肺癌的作用。","deSymptom":"1、暗适应能力下降，夜盲及干眼病； 2、粘膜、上皮改变； 3、生长发育受阻； 4、味觉、嗅觉减弱，食欲下降； 5、头发枯干、皮肤粗糙、记忆力减退、心情烦躁及失眠。","muchHarm":"1、急性维生素A中毒：成人一次剂量超过90-~300mg（30-100万IU），儿童一次剂量超过90mg（30万IU）即可发生急性中毒，主要表现为嗜睡或过度兴奋、头痛、呕吐等高颅压症状，12~20小时后出现皮肤红肿，继而脱皮，以手掌、脚底等厚处最为明显，数周后方恢复正常。 2、慢性维生素A中毒：成人每天摄入24-30mg，持续半年；或每天9-12mg，超过8年可引起慢性中毒。婴幼儿每天摄入15~30mg，超过6个月即可引起慢性中毒。主要表现为胃纳减退，体重下降，继而有皮肤干燥，脱屑，皲裂，毛发干枯，脱发，齿龈红肿，唇干裂和鼻出血等皮肤粘膜损伤现象，以及长骨肌肉连接处疼痛伴肿胀，体检可见贫血，脾脏肿大。","source":"胡萝卜素主要存在于深绿色或红黄色的蔬菜和水果中，如：胡萝卜、西兰花、菠菜、空心菜、甘薯、芒果、哈密瓜、杏及甜瓜等，大体上，越是颜色强烈的水果或蔬菜，含β-胡萝卜素越丰富。 深色蔬菜可以焯着吃，也可以炖着吃。深色蔬菜因含热量、蛋白质极少，所以在做菜或食用时，最好能和肉、鱼、蛋搭配，并和米饭、面包等谷物食品一起吃。","focusGroups":"孕妇、孕早期、产妇","highContentOfSource":"每100克食品中 螺旋藻： 38810微克 枸杞子： 9750 微克 西兰花： 7210 微克 绿茶: 5800 微克 胡萝卜： 4130 微克 沙棘果： 3840 微克 芒果： 897 微克 番茄： 375 微克"},{"id":13,"name":"维生素A","otherName":"视黄醇","unit":"微克","introduction":"维生素A的化学名为视黄醇，是最早被发现的维生素。具有调节表皮及角质层新陈代谢的功效，可以抗衰老，去皱纹。有助于保护表皮，黏膜不受细菌侵害，健康皮肤，预防皮肤癌。 预防夜盲症，视力衰退，治疗各种眼疾，使女人明眸善睐。 促进骨骼生长，帮助牙齿生长，再生。有效预防肥胖，保持女性苗条的身材。可有助于防治脱发。","deSymptom":"患维生素A缺乏[1]病常有营养不良、慢性腹泻、慢性痢疾、麻疹后长期忌嘴，畏光、不明眨眼等合并症。年长儿皮肤会有干燥、毛囊角化等改变。早期及非典型的病例，眼部的变化较轻，特别在婴幼儿期容易被忽略。若食物中维生素A缺乏或有吸收障碍，可在数星期内出现症状。婴儿患先天性胆道梗阻、肝炎综合征，若并发肺炎则可在短时间内出现眼干燥症。","muchHarm":"由于维生素A可以在脂肪中储存，过量摄入维生素A会造成蓄积性毒性，β胡萝卜素则没有这种危险，即使服用非常大的剂量也不会引起严重的副作用。但长期服用β胡萝卜素应该同时补充维生素E和叶黄素，因为β胡萝卜素会降低二者在人体内的水平。","source":"黄色水果如柑桔及黄、绿色蔬菜中均含有β胡萝卜素，动物脂肪如蛋黄及肝脏中含有一定的维生素A。此外，鱼肝油也是维生素A的良好来源","focusGroups":"婴幼儿、青少年、孕妇、乳母、老年人","highContentOfSource":"鱼肝油、羊肝、牛肝、鸡肝、猪肝、鸭蛋黄、胡萝卜、菠菜、鸡蛋黄、荠菜"},{"id":14,"name":"维生素B1","otherName":"硫胺素","unit":"毫克","introduction":"维生素B1主要治疗维生素B1缺乏的预防和治疗，如\u201c脚气病\u201d，周围神经炎及消化不良。妊娠或哺乳期，甲状腺功能亢进，烧伤，长期慢性感染，重体力劳动，吸收不良综合症伴肝胆疾病，小肠系统疾病及胃切除后维生素B1的补充。","deSymptom":"维生素B1缺乏可引起脚气病。临床上根据年龄差异分为成人脚气病和婴儿脚气病。","muchHarm":null,"source":"维生素B1广泛存在于天然食物中，最为丰富的来源是葵花籽仁、花生、大豆粉、瘦猪肉；其次为小麦粉、小米、玉米、大米等谷类食物；鱼类、蔬菜和水果中含量较少。建议食用碾磨度不太精细的谷物，可防治维生素B1缺乏。","focusGroups":"婴幼儿、孕妇、乳母、老年人","highContentOfSource":"葵花籽仁、花生仁、瘦猪肉、大豆、蚕豆、小米、麸皮、小麦粉、玉米、稻米、猪肝、鸡蛋"},{"id":15,"name":"维生素B2","otherName":"核黄素","unit":"毫克","introduction":"维生素B2又叫核黄素，微溶于水，在中性或酸性溶液中加热是稳定的。体内维生素B2的储存是很有限的，因此每天都要由饮食提供。","deSymptom":"维生素B2的欠缺会导致口腔、唇、皮肤、生殖器的炎症和机能障碍，称为核黄素缺乏病；长期缺乏会导致儿童生长迟缓，轻中度缺铁性贫血；严重缺乏时常伴有其它B族维生素缺乏症状。","muchHarm":"维生素B2是水溶性维生素，虽然摄入过量会从尿液中排出，但并不能说过量服用维生素B2对人体没有任何副作用。","source":"动物肝脏、鸡蛋、牛奶、豆类及某些蔬菜，如雪里红、油菜、菠菜、青蒜等绿叶蔬菜都能提供维生素B2。 动物内脏含维生素B2很丰富，尤其是肝脏含量最高。每天只要食用这些内脏50～100克，就可满足儿童、少年一天的维生素B2的需要。其他动物性食物如猪肉、鸡蛋，水产品中的鳝鱼、河蟹等也都含有较多的维生素B2。","focusGroups":"婴幼儿、孕妇、乳母、糖尿病人","highContentOfSource":"奶类及其制品、动物肝脏与肾脏、蛋黄、鳝鱼、菠菜、胡萝卜、酿造酵母、香菇、紫菜、茄子"},{"id":16,"name":"维生素B6","otherName":"吡哆素","unit":"毫克","introduction":null,"deSymptom":null,"muchHarm":null,"source":null,"focusGroups":null,"highContentOfSource":null}]
     * statusCode : 200
     * message : 获取成功
     * returnTime : 2020-07-06T15:49:06.946167+08:00
     */

    private int statusCode;
    private String message;
    private String returnTime;
    private List<NutrientInformationBean> nutrientInformation;

    public int getStatusCode() {
        return statusCode;
    }

    public void setStatusCode(int statusCode) {
        this.statusCode = statusCode;
    }

    public String getMessage() {
        return message;
    }

    public void setMessage(String message) {
        this.message = message;
    }

    public String getReturnTime() {
        return returnTime;
    }

    public void setReturnTime(String returnTime) {
        this.returnTime = returnTime;
    }

    public List<NutrientInformationBean> getNutrientInformation() {
        return nutrientInformation;
    }

    public void setNutrientInformation(List<NutrientInformationBean> nutrientInformation) {
        this.nutrientInformation = nutrientInformation;
    }

    public static class NutrientInformationBean {
        /**
         * id : 1
         * name : 能量
         * otherName : 热量
         * unit : 千卡
         * introduction : null
         * deSymptom : null
         * muchHarm : null
         * source : null
         * focusGroups : null
         * highContentOfSource : null
         */

        private int id;
        private String name;
        private String otherName;
        private String unit;
        private Object introduction;
        private Object deSymptom;
        private Object muchHarm;
        private Object source;
        private Object focusGroups;
        private Object highContentOfSource;

        public int getId() {
            return id;
        }

        public void setId(int id) {
            this.id = id;
        }

        public String getName() {
            return name;
        }

        public void setName(String name) {
            this.name = name;
        }

        public String getOtherName() {
            return otherName;
        }

        public void setOtherName(String otherName) {
            this.otherName = otherName;
        }

        public String getUnit() {
            return unit;
        }

        public void setUnit(String unit) {
            this.unit = unit;
        }

        public Object getIntroduction() {
            return introduction;
        }

        public void setIntroduction(Object introduction) {
            this.introduction = introduction;
        }

        public Object getDeSymptom() {
            return deSymptom;
        }

        public void setDeSymptom(Object deSymptom) {
            this.deSymptom = deSymptom;
        }

        public Object getMuchHarm() {
            return muchHarm;
        }

        public void setMuchHarm(Object muchHarm) {
            this.muchHarm = muchHarm;
        }

        public Object getSource() {
            return source;
        }

        public void setSource(Object source) {
            this.source = source;
        }

        public Object getFocusGroups() {
            return focusGroups;
        }

        public void setFocusGroups(Object focusGroups) {
            this.focusGroups = focusGroups;
        }

        public Object getHighContentOfSource() {
            return highContentOfSource;
        }

        public void setHighContentOfSource(Object highContentOfSource) {
            this.highContentOfSource = highContentOfSource;
        }
    }
}
